[
   {
      "name":"Acrobatic",
      "types":[

      ],
      "description":"You are skilled at leaping, jumping, and flying.",
      "bonus":[
         {
            "benefit":" You get a +2 bonus on all Acrobatics and Fly skill checks. If you have 10 or more ranks in one of these skills, the bonus increases to +4 for that skill."
         }
      ],
      "mods":[
        { "acrobatics":2 },
        { "fly":2 }
      ]
   },
   {
      "name":"Acrobatic Steps",
      "types":[

      ],
      "description":"You can easily move over and through obstacles.",
      "bonus":[
         {
            "benefit":" Whenever you move, you may move through up to 15 feet of difficult terrain each round as if it were normal terrain. The effects of this feat stack with those provided by Nimble Moves (allowing you to move normally through a total of 20 feet of difficult terrain each round)."
         }
      ],
      "prerequisites":" Dex 15, Nimble Moves."
   },
   {
      "name":"Agile Maneuvers",
      "types":[
         "Combat"
      ],
      "description":"You've learned to use your quickness in place of brute force when performing combat maneuvers.",
      "bonus":[
         {
            "benefit":" You add your Dexterity bonus to your base attack bonus and size bonus when determining your Combat Maneuver Bonus (see Combat) instead of your Strength bonus."
         },
         {
            "normal":" You add your Strength bonus to your base attack bonus and size bonus when determining your Combat Maneuver Bonus."
         }
      ]
   },
   {
      "name":"Alertness",
      "types":[

      ],
      "description":"You often notice things that others might miss.",
      "bonus":[
         {
            "benefit":" You get a +2 bonus on Perception and Sense Motive skill checks. If you have 10 or more ranks in one of these skills, the bonus increases to +4 for that skill."
         }
      ]
   },
   {
      "name":"Alignment Channel",
      "types":[

      ],
      "description":"Choose chaos, evil, good, or law. You can channel divine energy to affect outsiders that possess this subtype.",
      "bonus":[
         {
            "benefit":" Instead of its normal effect, you can choose to have your ability to channel energy heal or harm outsiders of the chosen alignment subtype. You must make this choice each time you channel energy. If you choose to heal or harm creatures of the chosen alignment subtype, your channel energy has no effect on other creatures. The amount of damage healed or dealt and the DC to halve the damage is otherwise unchanged."
         },
         {
            "special":" You can gain this feat multiple times. Its effects do not stack. Each time you take this feat, it applies to a new alignment subtype. Whenever you channel energy, you must choose which type to effect."
         }
      ],
      "prerequisites":" Ability to channel energy."
   },
   {
      "name":"Animal Affinity",
      "types":[

      ],
      "description":"You are skilled at working with animals and mounts.",
      "bonus":[
         {
            "benefit":" You get a +2 bonus on all Handle Animal and Ride skill checks. If you have 10 or more ranks in one of these skills, the bonus increases to +4 for that skill."
         }
      ]
   },
   {
      "name":"Arcane Armor Mastery",
      "types":[
         "Combat"
      ],
      "description":"You have mastered the ability to cast spells while wearing armor.",
      "bonus":[
         {
            "benefit":" As a swift action, reduce the arcane spell failure chance due to the armor you are wearing by 20% for any spells you cast this round. This bonus replaces, and does not stack with, the bonus granted by Arcane Armor Training."
         }
      ],
      "prerequisites":" Arcane Armor Training, Medium Armor Proficiency, caster level 7th."
   },
   {
      "name":"Arcane Armor Training",
      "types":[
         "Combat"
      ],
      "description":"You have learned how to cast spells while wearing armor.",
      "bonus":[
         {
            "benefit":" As a swift action, reduce the arcane spell failure chance due to the armor you are wearing by 10% for any spells you cast this round."
         }
      ],
      "prerequisites":" Light Armor Proficiency, caster level 3rd."
   },
   {
      "name":"Arcane Strike",
      "types":[
         "Combat"
      ],
      "description":"You draw upon your arcane power to enhance your weapons with magical energy.",
      "bonus":[
         {
            "prerequisite":" Ability to cast arcane spells."
         },
         {
            "benefit":" As a swift action, you can imbue your weapons with a fraction of your power. For 1 round, your weapons deal +1 damage and are treated as magic for the purpose of overcoming damage reduction. For every five caster levels you possess, this bonus increases by +1, to a maximum of +5 at 20th level."
         }
      ]
   },
   {
      "name":"Armor Proficiency, Heavy",
      "types":[
         "Combat"
      ],
      "description":"You are skilled at wearing heavy armor.",
      "bonus":[
         {
            "benefit":" See Armor Proficiency, Light."
         },
         {
            "normal":" See Armor Proficiency, Light."
         },
         {
            "special":" Fighters and paladins automatically have Heavy Armor Proficiency as a bonus feat. They need not select it."
         }
      ],
      "prerequisites":" Light Armor Proficiency, Medium Armor Proficiency."
   },
   {
      "name":"Armor Proficiency, Light",
      "types":[
         "Combat"
      ],
      "description":"You are skilled at wearing light armor.",
      "bonus":[
         {
            "benefit":" When you wear a type of armor with which you are proficient, the armor check penalty for that armor applies only to Dexterity- and Strength-based skill checks."
         },
         {
            "normal":" A character who is wearing armor with which he is not proficient applies its armor check penalty to attack rolls and to all skill checks that involve moving."
         },
         {
            "special":" All characters except monks, sorcerers, and wizards automatically have Light Armor Proficiency as a bonus feat. They need not select it."
         }
      ]
   },
   {
      "name":"Armor Proficiency, Medium",
      "types":[
         "Combat"
      ],
      "description":"You are skilled at wearing medium armor.",
      "bonus":[
         {
            "prerequisite":" Light Armor Proficiency."
         },
         {
            "benefit":" See Armor Proficiency, Light."
         },
         {
            "normal":" See Armor Proficiency, Light."
         },
         {
            "special":" Barbarians, clerics, druids, fighters, paladins, and rangers automatically have Medium Armor Proficiency as a bonus feat. They need not select it."
         }
      ]
   },
   {
      "name":"Athletic",
      "types":[

      ],
      "description":"You possess inherent physical prowess.",
      "bonus":[
         {
            "benefit":" You get a +2 bonus on Climb and Swim skill checks. If you have 10 or more ranks in one of these skills, the bonus increases to +4 for that skill."
         }
      ]
   },
   {
      "name":"Augment Summoning",
      "types":[

      ],
      "description":"Your summoned creatures are more powerful and robust.",
      "bonus":[
         {
            "prerequisite":" Spell Focus (conjuration)."
         },
         {
            "benefit":" Each creature you conjure with any summon spell gains a +4 enhancement bonus to Strength and Constitution for the duration of the spell that summoned it."
         }
      ]
   },
   {
      "name":"Bleeding Critical",
      "types":[
         "Combat",
         " Critical"
      ],
      "description":"Your critical hits cause opponents to bleed profusely.",
      "bonus":[
         {
            "benefit":" Whenever you score a critical hit with a slashing or piercing weapon, your opponent takes 2d6 points of bleed damage (see Conditions) each round on his turn, in addition to the damage dealt by the critical hit. Bleed damage can be stopped by a DC 15 Heal skill check or through any magical healing. The effects of this feat stack."
         },
         {
            "special":" You can only apply the effects of one critical feat to a given critical hit unless you possess Critical Mastery."
         }
      ],
      "prerequisites":" Critical Focus, base attack bonus +11."
   },
   {
      "name":"Blind-Fight",
      "types":[
         "Combat"
      ],
      "description":"You are skilled at attacking opponents that you cannot clearly perceive.",
      "bonus":[
         {
            "benefit":" In melee, every time you miss because of concealment (see Combat), you can reroll your miss chance percentile roll one time to see if you actually hit."
         },
         {
            "text":"an invisible attacker gets no advantages related to hitting you in melee. that is, you don't lose your dexterity bonus to armor class, and the attacker doesn't get the usual +2 bonus for being invisible. the invisible attacker's bonuses do still apply for ranged attacks, however."
         },
         {
            "text":"you do not need to make acrobatics skill checks to move at full speed while blinded."
         },
         {
            "normal":" Regular attack roll modifiers for invisible attackers trying to hit you apply, and you lose your Dexterity bonus to AC. The speed reduction for darkness and poor visibility also applies."
         },
         {
            "special":" The Blind-Fight feat is of no use against a character who is the subject of a blink spell."
         }
      ]
   },
   {
      "name":"Blinding Critical",
      "types":[
         "Combat",
         " Critical"
      ],
      "description":"Your critical hits blind your opponents.",
      "bonus":[
         {
            "benefit":" Whenever you score a critical hit, your opponent is permanently blinded. A successful Fortitude save reduces this to dazzled for 1d4 rounds. The DC of this Fortitude save is equal to 10 + your base attack bonus. This feat has no effect on creatures that do not rely on eyes for sight or creatures with more than two eyes (although multiple critical hits might cause blindness, at the GM's discretion). Blindness can be cured by heal, regeneration, remove blindness, or similar abilities."
         },
         {
            "special":" You can only apply the effects of one critical feat to a given critical hit unless you possess Critical Mastery."
         }
      ],
      "prerequisites":" Critical Focus, base attack bonus +15."
   },
   {
      "name":"Brew Potion",
      "types":[
         "Item Creation"
      ],
      "description":"You can create magic potions.",
      "bonus":[
         {
            "prerequisite":" Caster level 3rd."
         },
         {
            "benefit":" You can create a potion of any 3rd-level or lower spell that you know and that targets one or more creatures or objects. Brewing a potion takes 2 hours if its base price is 250 gp or less, otherwise brewing a potion takes 1 day for each 1,000 gp in its base price. When you create a potion, you set the caster level, which must be sufficient to cast the spell in question and no higher than your own level. To brew a potion, you must use up raw materials costing one half this base price. See the magic item creation rules in Magic Items for more information."
         },
         {
            "text":"when you create a potion, you make any choices that you would normally make when casting the spell. whoever drinks the potion is the target of the spell."
         }
      ]
   },
   {
      "name":"Catch Off-Guard",
      "types":[
         "Combat"
      ],
      "description":"Foes are surprised by your skilled use of unorthodox and improvised weapons.",
      "bonus":[
         {
            "benefit":" You do not suffer any penalties for using an improvised melee weapon. Unarmed opponents are flat-footed against any attacks you make with an improvised melee weapon."
         },
         {
            "normal":" You take a –4 penalty on attack rolls made with an improvised weapon."
         }
      ]
   },
   {
      "name":"Channel Smite",
      "types":[
         "Combat"
      ],
      "description":"You can channel your divine energy through a melee weapon you wield.",
      "bonus":[
         {
            "prerequisite":" Channel energy class feature."
         },
         {
            "benefit":" Before you make a melee attack roll, you can choose to spend one use of your channel energy ability as a swift action. If you channel positive energy and you hit an undead creature, that creature takes an amount of additional damage equal to the damage dealt by your channel positive energy ability. If you channel negative energy and you hit a living creature, that creature takes an amount of additional damage equal to the damage dealt by your channel negative energy ability. Your target can make a Will save, as normal, to halve this additional damage. If your attack misses, the channel energy ability is still expended with no effect."
         }
      ]
   },
   {
      "name":"Cleave",
      "types":[
         "Combat"
      ],
      "description":"You can strike two adjacent foes with a single swing.",
      "bonus":[
         {
            "benefit":" As a standard action, you can make a single attack at your full base attack bonus against a foe within reach. If you hit, you deal damage normally and can make an additional attack (using your full base attack bonus) against a foe that is adjacent to the first and also within reach. You can only make one additional attack per round with this feat. When you use this feat, you take a –2 penalty to your Armor Class until your next turn."
         }
      ],
      "prerequisites":" Str 13, Power Attack, base attack bonus +1."
   },
   {
      "name":"Combat Casting",
      "types":[

      ],
      "description":"You are adept at spellcasting when threatened or distracted.",
      "bonus":[
         {
            "benefit":" You get a +4 bonus on concentration checks made to cast a spell or use a spell-like ability when casting on the defensive or while grappled."
         }
      ]
   },
   {
      "name":"Combat Expertise",
      "types":[
         "Combat"
      ],
      "description":"You can increase your defense at the expense of your accuracy.",
      "bonus":[
         {
            "prerequisite":" Int 13."
         },
         {
            "benefit":" You can choose to take a –1 penalty on melee attack rolls and combat maneuver checks to gain a +1 dodge bonus to your Armor Class. When your base attack bonus reaches +4, and every +4 thereafter, the penalty increases by –1 and the dodge bonus increases by +1. You can only choose to use this feat when you declare that you are making an attack or a full-attack action with a melee weapon. The effects of this feat last until your next turn."
         }
      ]
   },
   {
      "name":"Combat Reflexes",
      "types":[
         "Combat"
      ],
      "description":"You can make additional attacks of opportunity.",
      "bonus":[
         {
            "benefit":" You may make a number of additional attacks of opportunity per round equal to your Dexterity bonus. With this feat, you may also make attacks of opportunity while flat-footed."
         },
         {
            "normal":" A character without this feat can make only one attack of opportunity per round and can't make attacks of opportunity while flat-footed."
         },
         {
            "special":" The Combat Reflexes feat does not allow a rogue to use her opportunist ability more than once per round."
         }
      ]
   },
   {
      "name":"Command Undead",
      "types":[

      ],
      "description":"Using foul powers of necromancy, you can command undead creatures, making them into your servants.",
      "bonus":[
         {
            "benefit":" As a standard action, you can use one of your uses of channel negative energy to enslave undead within 30 feet. Undead receive a Will save to negate the effect. The DC for this Will save is equal to 10 + 1/2 your cleric level + your Charisma modifier. Undead that fail their saves fall under your control, obeying your commands to the best of their ability, as if under the effects of control undead. Intelligent undead receive a new saving throw each day to resist your command. You can control any number of undead, so long as their total Hit Dice do not exceed your cleric level. If you use channel energy in this way, it has no other effect (it does not heal or harm nearby creatures). If an undead creature is under the control of another creature, you must make an opposed Charisma check whenever your orders conflict."
         }
      ],
      "prerequisites":" Channel negative energy class feature."
   },
   {
      "name":"Craft Magic Arms and Armor",
      "types":[
         "Item Creation"
      ],
      "description":"You can create magic armor, shields, and weapons.",
      "bonus":[
         {
            "prerequisite":" Caster level 5th."
         },
         {
            "benefit":" You can create magic weapons, armor, or shields. Enhancing a weapon, suit of armor, or shield takes 1 day for each 1,000 gp in the price of its magical features. To enhance a weapon, suit of armor, or shield, you must use up raw materials costing half of this total price. See the magic item creation rules in Magic Items for more information."
         },
         {
            "text":"the weapon, armor, or shield to be enhanced must be a masterwork item that you provide. its cost is not included in the above cost."
         },
         {
            "text":"you can also mend a broken magic weapon, suit of armor, or shield if it is one that you could make. doing so costs half the raw materials and half the time it would take to craft that item in the first place."
         }
      ]
   },
   {
      "name":"Craft Rod",
      "types":[
         "Item Creation"
      ],
      "description":"You can create magic rods.",
      "bonus":[
         {
            "prerequisite":" Caster level 9th."
         },
         {
            "benefit":" You can create magic rods. Crafting a rod takes 1 day for each 1,000 gp in its base price. To craft a rod, you must use up raw materials costing half of its base price. See the magic item creation rules in Magic Items for more information."
         }
      ]
   },
   {
      "name":"Craft Staff",
      "types":[
         "Item Creation"
      ],
      "description":"You can create magic staves.",
      "bonus":[
         {
            "prerequisite":" Caster level 11th."
         },
         {
            "benefit":" You can create any staff whose prerequisites you meet. Crafting a staff takes 1 day for each 1,000 gp in its base price. To craft a staff, you must use up raw materials costing half of its base price. A newly created staff has 10 charges. See the magic item creation rules in Magic Items for more information."
         }
      ]
   },
   {
      "name":"Craft Wand",
      "types":[
         "Item Creation"
      ],
      "description":"You can create magic wands.",
      "bonus":[
         {
            "prerequisite":" Caster level 5th."
         },
         {
            "benefit":" You can create a wand of any 4th-level or lower spell that you know. Crafting a wand takes 1 day for each 1,000 gp in its base price. To craft a wand, you must use up raw materials costing half of this base price. A newly created wand has 50 charges. See the magic item creation rules in Magic Items for more information."
         }
      ]
   },
   {
      "name":"Craft Wondrous Item",
      "types":[
         "Item Creation"
      ],
      "description":"You can create wondrous items, a type of magic item.",
      "bonus":[
         {
            "prerequisite":" Caster level 3rd."
         },
         {
            "benefit":" You can create a wide variety of magic wondrous items. Crafting a wondrous item takes 1 day for each 1,000 gp in its price. To create a wondrous item, you must use up raw materials costing half of its base price. See the magic item creation rules in Magic Items for more information."
         },
         {
            "text":"you can also mend a broken wondrous item if it is one that you could make. doing so costs half the raw materials and half the time it would take to craft that item."
         }
      ]
   },
   {
      "name":"Critical Focus",
      "types":[
         "Combat"
      ],
      "description":"You are trained in the art of causing pain.",
      "bonus":[
         {
            "benefit":" You receive a +4 circumstance bonus on attack rolls made to confirm critical hits."
         }
      ],
      "prerequisites":" Base attack bonus +9."
   },
   {
      "name":"Critical Mastery",
      "types":[
         "Combat"
      ],
      "description":"Your critical hits cause two additional effects.",
      "bonus":[
         {
            "benefit":" When you score a critical hit, you can apply the effects of two critical feats in addition to the damage dealt."
         },
         {
            "normal":" You can only apply the effects of one critical feat to a given critical hit in addition to the damage dealt."
         }
      ],
      "prerequisites":" Critical Focus, any two critical feats, 14th-level fighter."
   },
   {
      "name":"Dazzling Display",
      "types":[
         "Combat"
      ],
      "description":"Your skill with your favored weapon can frighten enemies.",
      "bonus":[
         {
            "prerequisite":" Weapon Focus, proficiency with the selected weapon."
         },
         {
            "benefit":" While wielding the weapon in which you have Weapon Focus, you can perform a bewildering show of prowess as a full-round action. Make an Intimidate check to demoralize all foes within 30 feet who can see your display."
         }
      ]
   },
   {
      "name":"Deadly Aim",
      "types":[
         "Combat"
      ],
      "description":"You can make exceptionally deadly ranged attacks by pinpointing a foe's weak spot, at the expense of making the attack less likely to succeed.",
      "bonus":[
         {
            "benefit":" You can choose to take a –1 penalty on all ranged attack rolls to gain a +2 bonus on all ranged damage rolls. When your base attack bonus reaches +4, and every +4 thereafter, the penalty increases by –1 and the bonus to damage increases by +2. You must choose to use this feat before making an attack roll and its effects last until your next turn. The bonus damage does not apply to touch attacks or effects that do not deal hit point damage."
         }
      ],
      "prerequisites":" Dex 13, base attack bonus +1."
   },
   {
      "name":"Deadly Stroke",
      "types":[
         "Combat"
      ],
      "description":"With a well-placed strike, you can bring a swift and painful end to most foes.",
      "bonus":[
         {
            "benefit":" As a standard action, make a single attack with the weapon for which you have Greater Weapon Focus against a stunned or flat-footed opponent. If you hit, you deal double the normal damage and the target takes 1 point of Constitution bleed (see Conditions). The additional damage and bleed is not multiplied on a critical hit."
         }
      ],
      "prerequisites":" Dazzling Display, Greater Weapon Focus, Shatter Defenses, Weapon Focus, proficiency with the selected weapon, base attack bonus +11."
   },
   {
      "name":"Deafening Critical",
      "types":[
         "Combat",
         " Critical"
      ],
      "description":"Your critical hits cause enemies to lose their hearing.",
      "bonus":[
         {
            "benefit":" Whenever you score a critical hit against an opponent, the victim is permanently deafened. A successful Fortitude save reduces the deafness to 1 round. The DC of this Fortitude save is equal to 10 + your base attack bonus. This feat has no effect on deaf creatures. This deafness can be cured by heal, regeneration, remove deafness, or a similar ability."
         },
         {
            "special":" You can only apply the effects of one critical feat to a given critical hit unless you possess Critical Mastery."
         }
      ],
      "prerequisites":" Critical Focus, base attack bonus +13."
   },
   {
      "name":"Deceitful",
      "types":[

      ],
      "description":"You are skilled at deceiving others, both with the spoken word and with physical disguises.",
      "bonus":[
         {
            "benefit":" You get a +2 bonus on all Bluff and Disguise skill checks. If you have 10 or more ranks in one of these skills, the bonus increases to +4 for that skill."
         }
      ]
   },
   {
      "name":"Defensive Combat Training",
      "types":[
         "Combat"
      ],
      "description":"You excel at defending yourself from all manner of combat maneuvers.",
      "bonus":[
         {
            "benefit":" You treat your total Hit Dice as your base attack bonus when calculating your Combat Maneuver Defense (see Combat)."
         }
      ]
   },
   {
      "name":"Deflect Arrows",
      "types":[
         "Combat"
      ],
      "description":"You can knock arrows and other projectiles off course, preventing them from hitting you.",
      "bonus":[
         {
            "benefit":" You must have at least one hand free (holding nothing) to use this feat. Once per round when you would normally be hit with an attack from a ranged weapon, you may deflect it so that you take no damage from it. You must be aware of the attack and not flat-footed. Attempting to deflect a ranged attack doesn't count as an action. Unusually massive ranged weapons (such as boulders or ballista bolts) and ranged attacks generated by natural attacks or spell effects can't be deflected."
         }
      ],
      "prerequisites":" Dex 13, Improved Unarmed Strike."
   },
   {
      "name":"Deft Hands",
      "types":[

      ],
      "description":"You have exceptional manual dexterity.",
      "bonus":[
         {
            "benefit":" You get a +2 bonus on Disable Device and Sleight of Hand skill checks. If you have 10 or more ranks in one of these skills, the bonus increases to +4 for that skill."
         }
      ]
   },
   {
      "name":"Diehard",
      "types":[

      ],
      "description":"You are especially hard to kill. Not only do your wounds automatically stabilize when grievously injured, but you can remain conscious and continue to act even at death's door.",
      "bonus":[
         {
            "prerequisite":" Endurance."
         },
         {
            "benefit":" When your hit point total is below 0, but you are not dead, you automatically stabilize. You do not need to make a Constitution check each round to avoid losing additional hit points. You may choose to act as if you were disabled, rather than dying. You must make this decision as soon as you are reduced to negative hit points (even if it isn't your turn). If you do not choose to act as if you were disabled, you immediately fall unconscious."
         },
         {
            "text":"when using this feat, you are staggered. you can take a move action without further injuring yourself, but if you perform any standard action (or any other action deemed as strenuous, including some swift actions, such as casting a quickened spell) you take 1 point of damage after completing the act. if your negative hit points are equal to or greater than your constitution score, you immediately die."
         },
         {
            "normal":" A character without this feat who is reduced to negative hit points is unconscious and dying."
         }
      ]
   },
   {
      "name":"Disruptive",
      "types":[
         "Combat"
      ],
      "description":"Your training makes it difficult for enemy spellcasters to safely cast spells near you.",
      "bonus":[
         {
            "benefit":" The DC to cast spells defensively increases by +4 for all enemies that are within your threatened area. This increase to casting spells defensively only applies if you are aware of the enemy's location and are capable of taking an attack of opportunity. If you can only take one attack of opportunity per round and have already used that attack, this increase does not apply."
         }
      ],
      "prerequisites":" 6th-level fighter."
   },
   {
      "name":"Dodge",
      "types":[
         "Combat"
      ],
      "description":"Your training and reflexes allow you to react swiftly to avoid an opponents' attacks.",
      "bonus":[
         {
            "prerequisite":" Dex 13."
         },
         {
            "benefit":" You gain a +1 dodge bonus to your AC. A condition that makes you lose your Dex bonus to AC also makes you lose the benefits of this feat."
         }
      ]
   },
   {
      "name":"Double Slice",
      "types":[
         "Combat"
      ],
      "description":"Your off-hand weapon while dual-wielding strikes with greater power.",
      "bonus":[
         {
            "prerequisite":" Dex 15, Two-Weapon Fighting."
         },
         {
            "benefit":" Add your Strength bonus to damage rolls made with your off-hand weapon."
         },
         {
            "normal":" You normally add only half of your Strength modifier to damage rolls made with a weapon wielded in your off-hand."
         }
      ]
   },
   {
      "name":"Elemental Channel",
      "types":[

      ],
      "description":"Choose one elemental subtype, such as air, earth, fire, or water. You can channel your divine energy to harm or heal outsiders that possess your chosen elemental subtype.",
      "bonus":[
         {
            "benefit":" Instead of its normal effect, you can choose to have your ability to channel energy heal or harm outsiders of your chosen elemental subtype. You must make this choice each time you channel energy. If you choose to heal or harm creatures of your elemental subtype, your channel energy has no effect on other creatures. The amount of damage healed or dealt and the DC to halve the damage is otherwise unchanged."
         },
         {
            "special":" You can gain this feat multiple times. Its effects do not stack. Each time you take this feat, it applies to a new elemental subtype."
         }
      ],
      "prerequisites":" Channel energy class feature."
   },
   {
      "name":"Empower Spell",
      "types":[
         "Metamagic"
      ],
      "description":"You can increase the power of your spells, causing them to deal more damage.",
      "bonus":[
         {
            "benefit":" All variable, numeric effects of an empowered spell are increased by half, including bonuses to those dice rolls."
         },
         {
            "text":"saving throws and opposed rolls are not affected, nor are spells without random variables. an empowered spell uses up a spell slot two levels higher than the spell's actual level."
         }
      ]
   },
   {
      "name":"Endurance",
      "types":[

      ],
      "description":"Harsh conditions or long exertions do not easily tire you.",
      "bonus":[
         {
            "benefit":" You gain a +4 bonus on the following checks and saves"
         },
         {
            "text":"you may sleep in light or medium armor without becoming fatigued."
         },
         {
            "normal":" A character without this feat who sleeps in medium or heavier armor is fatigued the next day."
         }
      ]
   },
   {
      "name":"Enlarge Spell",
      "types":[
         "Metamagic"
      ],
      "description":"You can increase the range of your spells.",
      "bonus":[
         {
            "benefit":" You can alter a spell with a range of close, medium, or long to increase its range by 100%. An enlarged spell with a range of close now has a range of 50 ft. + 5 ft./level, while medium-range spells have a range of 200 ft. + 20 ft./level and long-range spells have a range of 800 ft. + 80 ft./level. An enlarged spell uses up a spell slot one level higher than the spell's actual level."
         },
         {
            "text":"spells whose ranges are not defined by distance, as well as spells whose ranges are not close, medium, or long, do not benefit from this feat."
         }
      ]
   },
   {
      "name":"Eschew Materials",
      "types":[

      ],
      "description":"You can cast many spells without needing to utilize minor material components.",
      "bonus":[
         {
            "benefit":" You can cast any spell with a material component costing 1 gp or less without needing that component. The casting of the spell still provokes attacks of opportunity as normal. If the spell requires a material component that costs more than 1 gp, you must have the material component on hand to cast the spell, as normal."
         }
      ]
   },
   {
      "name":"Exhausting Critical",
      "types":[
         "Combat",
         " Critical"
      ],
      "description":"Your critical hits cause opponents to become exhausted.",
      "bonus":[
         {
            "benefit":" When you score a critical hit on a foe, your target immediately becomes exhausted. This feat has no effect on exhausted creatures."
         },
         {
            "special":" You can only apply the effects of one critical feat to a given critical hit unless you possess the Critical Mastery feat."
         }
      ],
      "prerequisites":" Critical Focus, Tiring Critical, base attack bonus +15."
   },
   {
      "name":"Exotic Weapon Proficiency",
      "types":[
         "Combat"
      ],
      "description":"Choose one type of exotic weapon, such as the spiked chain or whip. You understand how to use that type of exotic weapon in combat, and can utilize any special tricks or qualities that exotic weapon might allow.",
      "bonus":[
         {
            "prerequisite":" Base attack bonus +1."
         },
         {
            "benefit":" You make attack rolls with the weapon normally."
         },
         {
            "normal":" A character who uses a weapon with which he is not proficient takes a –4 penalty on attack rolls."
         },
         {
            "special":" You can gain Exotic Weapon Proficiency multiple times. Each time you take the feat, it applies to a new type of exotic weapon."
         }
      ]
   },
   {
      "name":"Extend Spell",
      "types":[
         "Metamagic"
      ],
      "description":"You can make your spells last twice as long.",
      "bonus":[
         {
            "benefit":" An extended spell lasts twice as long as normal. A spell with a duration of concentration, instantaneous, or permanent is not affected by this feat. An extended spell uses up a spell slot one level higher than the spell's actual level."
         }
      ]
   },
   {
      "name":"Extra Channel",
      "types":[

      ],
      "description":"You can channel divine energy more often.",
      "bonus":[
         {
            "prerequisite":" Channel energy class feature."
         },
         {
            "benefit":" You can channel energy two additional times per day."
         },
         {
            "special":" If a paladin with the ability to channel positive energy takes this feat, she can use lay on hands four additional times a day, but only to channel positive energy."
         }
      ]
   },
   {
      "name":"Extra Ki",
      "types":[

      ],
      "description":"You can use your ki pool more times per day than most.",
      "bonus":[
         {
            "prerequisite":" Ki pool class feature."
         },
         {
            "benefit":" Your ki pool increases by 2."
         },
         {
            "special":" You can gain Extra Ki multiple times. Its effects stack."
         }
      ]
   },
   {
      "name":"Extra Lay On Hands",
      "types":[

      ],
      "description":"You can use your lay on hands ability more often.",
      "bonus":[
         {
            "prerequisite":" Lay on hands class feature."
         },
         {
            "benefit":" You can use your lay on hands ability two additional times per day."
         },
         {
            "special":" You can gain Extra Lay On Hands multiple times. Its effects stack."
         }
      ]
   },
   {
      "name":"Extra Mercy",
      "types":[

      ],
      "description":"Your lay on hands ability adds an additional mercy.",
      "bonus":[
         {
            "benefit":" Select one additional mercy for which you qualify. When you use lay on hands to heal damage to one target, it also receives the additional effects of this mercy."
         },
         {
            "special":" You can gain this feat multiple times. Its effects do not stack. Each time you take this feat, select a new mercy."
         }
      ],
      "prerequisites":" Lay on hands class feature, mercy class feature."
   },
   {
      "name":"Extra Performance",
      "types":[

      ],
      "description":"You can use your bardic performance ability more often than normal.",
      "bonus":[
         {
            "prerequisite":" Bardic performance class feature."
         },
         {
            "benefit":" You can use bardic performance for 6 additional rounds per day."
         },
         {
            "special":" You can gain Extra Performance multiple times. Its effects stack."
         }
      ]
   },
   {
      "name":"Extra Rage",
      "types":[

      ],
      "description":"You can use your rage ability more than normal.",
      "bonus":[
         {
            "prerequisite":" Rage class feature."
         },
         {
            "benefit":" You can rage for 6 additional rounds per day."
         },
         {
            "special":" You can gain Extra Rage multiple times. Its effects stack."
         }
      ]
   },
   {
      "name":"Far Shot",
      "types":[
         "Combat"
      ],
      "description":"You are more accurate at longer ranges.",
      "bonus":[
         {
            "benefit":" You only suffer a –1 penalty per full range increment between you and your target when using a ranged weapon."
         },
         {
            "normal":" You suffer a –2 penalty per full range increment between you and your target."
         }
      ],
      "prerequisites":" Point-Blank Shot."
   },
   {
      "name":"Fleet",
      "types":[

      ],
      "description":"You are faster than most.",
      "bonus":[
         {
            "benefit":" While you are wearing light or no armor, your base speed increases by 5 feet. You lose the benefits of this feat if you carry a medium or heavy load."
         },
         {
            "special":" You can take this feat multiple times. The effects stack."
         }
      ]
   },
   {
      "name":"Forge Ring",
      "types":[
         "Item Creation"
      ],
      "description":"You can create magic rings.",
      "bonus":[
         {
            "prerequisite":" Caster level 7th."
         },
         {
            "benefit":" You can create magic rings. Crafting a ring takes 1 day for each 1,000 gp in its base price. To craft a ring, you must use up raw materials costing half of the base price. See the magic item creation rules in Magic Items for more information."
         },
         {
            "text":"you can also mend a broken ring if it is one that you could make. doing so costs half the raw materials and half the time it would take to forge that ring in the first place."
         }
      ]
   },
   {
      "name":"Gorgon's Fist",
      "types":[
         "Combat"
      ],
      "description":"With one well-placed blow, you leave your target reeling.",
      "bonus":[
         {
            "benefit":" As a standard action, make a single unarmed melee attack against a foe whose speed is reduced (such as from Scorpion Style). If the attack hits, you deal damage normally and the target is staggered until the end of your next turn unless it makes a Fortitude saving throw (DC 10 + 1/2 your character level + your Wis modifier). This feat has no effect on targets that are staggered."
         }
      ],
      "prerequisites":" Improved Unarmed Strike, Scorpion Style, base attack bonus +6."
   },
   {
      "name":"Great Cleave",
      "types":[
         "Combat"
      ],
      "description":"You can strike many adjacent foes with a single blow.",
      "bonus":[
         {
            "benefit":" As a standard action, you can make a single attack at your full base attack bonus against a foe within reach. If you hit, you deal damage normally and can make an additional attack (using your full base attack bonus) against a foe that is adjacent to the previous foe and also within reach. If you hit, you can continue to make attacks against foes adjacent to the previous foe, so long as they are within your reach. You cannot attack an individual foe more than once during this attack action. When you use this feat, you take a –2 penalty to your Armor Class until your next turn."
         }
      ],
      "prerequisites":" Str 13, Cleave, Power Attack, base attack bonus +4."
   },
   {
      "name":"Great Fortitude",
      "types":[

      ],
      "description":"You are resistant to poisons, diseases, and other maladies.",
      "bonus":[
         {
            "benefit":" You get a +2 bonus on all Fortitude saving throws."
         }
      ]
   },
   {
      "name":"Greater Bull Rush",
      "types":[
         "Combat"
      ],
      "description":"Your bull rush attacks throw enemies off balance.",
      "bonus":[
         {
            "benefit":" You receive a +2 bonus on checks made to bull rush a foe. This bonus stacks with the bonus granted by Improved Bull Rush. Whenever you bull rush an opponent, his movement provokes attacks of opportunity from all of your allies (but not you)."
         },
         {
            "normal":" Creatures moved by bull rush do not provoke attacks of opportunity."
         }
      ],
      "prerequisites":" Improved Bull Rush, Power Attack, base attack bonus +6, Str 13."
   },
   {
      "name":"Greater Disarm",
      "types":[
         "Combat"
      ],
      "description":"You can knock weapons far from an enemy's grasp.",
      "bonus":[
         {
            "benefit":" You receive a +2 bonus on checks made to disarm a foe. This bonus stacks with the bonus granted by Improved Disarm. Whenever you successfully disarm an opponent, the weapon lands 15 feet away from its previous wielder, in a random direction."
         },
         {
            "normal":" Disarmed weapons and gear land at the feet of the disarmed creature."
         }
      ],
      "prerequisites":" Combat Expertise, Improved Disarm, base attack bonus +6, Int 13."
   },
   {
      "name":"Greater Feint",
      "types":[
         "Combat"
      ],
      "description":"You are skilled at making foes overreact to your attacks.",
      "bonus":[
         {
            "benefit":" Whenever you use feint to cause an opponent to lose his Dexterity bonus, he loses that bonus until the beginning of your next turn, in addition to losing his Dexterity bonus against your next attack."
         },
         {
            "normal":" A creature you feint loses its Dexterity bonus against your next attack."
         }
      ],
      "prerequisites":" Combat Expertise, Improved Feint, base attack bonus +6, Int 13."
   },
   {
      "name":"Greater Grapple",
      "types":[
         "Combat"
      ],
      "description":"Maintaining a grapple is second nature to you.",
      "bonus":[
         {
            "benefit":" You receive a +2 bonus on checks made to grapple a foe. This bonus stacks with the bonus granted by Improved Grapple. Once you have grappled a creature, maintaining the grapple is a move action. This feat allows you to make two grapple checks each round (to move, harm, or pin your opponent), but you are not required to make two checks. You only need to succeed at one of these checks to maintain the grapple."
         },
         {
            "normal":" Maintaining a grapple is a standard action."
         }
      ],
      "prerequisites":" Improved Grapple, Improved Unarmed Strike, base attack bonus +6, Dex 13."
   },
   {
      "name":"Greater Overrun",
      "types":[
         "Combat"
      ],
      "description":"Enemies must dive to avoid your dangerous move.",
      "bonus":[
         {
            "benefit":" You receive a +2 bonus on checks made to overrun a foe. This bonus stacks with the bonus granted by Improved Overrun. Whenever you overrun opponents, they provoke attacks of opportunity if they are knocked prone by your overrun."
         },
         {
            "normal":" Creatures knocked prone by your overrun do not provoke an attack of opportunity."
         }
      ],
      "prerequisites":" Improved Overrun, Power Attack, base attack bonus +6, Str 13."
   },
   {
      "name":"Greater Penetrating Strike",
      "types":[
         "Combat"
      ],
      "description":"Your attacks penetrate the defenses of most foes.",
      "bonus":[
         {
            "benefit":" Your attacks with weapons selected with Weapon Focus ignore up to 10 points of damage reduction. This amount is reduced to 5 points for damage reduction without a type (such as DR 10/—)."
         }
      ],
      "prerequisites":" Penetrating Strike, Weapon Focus, 16th-level fighter."
   },
   {
      "name":"Greater Shield Focus",
      "types":[
         "Combat"
      ],
      "description":"You are skilled at deflecting blows with your shield.",
      "bonus":[
         {
            "benefit":" Increase the AC bonus granted by any shield you are using by 1. This bonus stacks with the bonus granted by Shield Focus."
         }
      ],
      "prerequisites":" Shield Focus, Shield Proficiency, base attack bonus +1, 8th-level fighter."
   },
   {
      "name":"Greater Spell Focus",
      "types":[

      ],
      "description":"Choose a school of magic to which you have already applied the Spell Focus feat. Any spells you cast of this school are very hard to resist.",
      "bonus":[
         {
            "prerequisite":" Spell Focus."
         },
         {
            "benefit":" Add +1 to the Difficulty Class for all saving throws against spells from the school of magic you select. This bonus stacks with the bonus from Spell Focus."
         },
         {
            "special":" You can gain this feat multiple times. Its effects do not stack. Each time you take the feat, it applies to a new school to which you already have applied the Spell Focus feat."
         }
      ]
   },
   {
      "name":"Greater Spell Penetration",
      "types":[

      ],
      "description":"Your spells break through spell resistance much more easily than most.",
      "bonus":[
         {
            "prerequisite":" Spell Penetration."
         },
         {
            "benefit":" You get a +2 bonus on caster level checks (1d20 + caster level) made to overcome a creature's spell resistance. This bonus stacks with the one from Spell Penetration."
         }
      ]
   },
   {
      "name":"Greater Sunder",
      "types":[
         "Combat"
      ],
      "description":"Your devastating strikes cleave through weapons and armor and into their wielders, damaging both item and wielder alike in a single terrific strike.",
      "bonus":[
         {
            "benefit":" You receive a +2 bonus on checks made to sunder an item. This bonus stacks with the bonus granted by Improved Sunder. Whenever you sunder to destroy a weapon, shield, or suit of armor, any excess damage is applied to the item's wielder. No damage is transferred if you decide to leave the item with 1 hit point."
         }
      ],
      "prerequisites":" Improved Sunder, Power Attack, base attack bonus +6, Str 13."
   },
   {
      "name":"Greater Trip",
      "types":[
         "Combat"
      ],
      "description":"You can make free attacks on foes that you knock down.",
      "bonus":[
         {
            "benefit":" You receive a +2 bonus on checks made to trip a foe. This bonus stacks with the bonus granted by Improved Trip. Whenever you successfully trip an opponent, that opponent provokes attacks of opportunity."
         },
         {
            "normal":" Creatures do not provoke attacks of opportunity from being tripped."
         }
      ],
      "prerequisites":" Combat Expertise, Improved Trip, base attack bonus +6, Int 13."
   },
   {
      "name":"Greater Two-Weapon Fighting",
      "types":[
         "Combat"
      ],
      "description":"You are incredibly skilled at fighting with two weapons at the same time.",
      "bonus":[
         {
            "benefit":" You get a third attack with your off-hand weapon, albeit at a –10 penalty."
         }
      ],
      "prerequisites":" Dex 19, Improved Two-Weapon Fighting, Two-Weapon Fighting, base attack bonus +11."
   },
   {
      "name":"Greater Vital Strike",
      "types":[
         "Combat"
      ],
      "description":"You can make a single attack that deals incredible damage.",
      "bonus":[
         {
            "benefit":" When you use the attack action, you can make one attack at your highest base attack bonus that deals additional damage. Roll the weapon's damage dice for the attack four times and add the results together before adding bonuses from Strength, weapon abilities (such as flaming), precision based damage, and other damage bonuses. These extra weapon damage dice are not multiplied on a critical hit, but are added to the total."
         }
      ],
      "prerequisites":" Improved Vital Strike, Vital Strike, base attack bonus +16."
   },
   {
      "name":"Greater Weapon Focus",
      "types":[
         "Combat"
      ],
      "description":"Choose one type of weapon (including unarmed strike or grapple) for which you have already selected Weapon Focus. You are a master at your chosen weapon.",
      "bonus":[
         {
            "benefit":" You gain a +1 bonus on attack rolls you make using the selected weapon. This bonus stacks with other bonuses on attack rolls, including those from Weapon Focus."
         },
         {
            "special":" You can gain Greater Weapon Focus multiple times. Its effects do not stack. Each time you take the feat, it applies to a new type of weapon."
         }
      ],
      "prerequisites":" Proficiency with selected weapon, Weapon Focus with selected weapon, base attack bonus +1, 8th-level fighter."
   },
   {
      "name":"Greater Weapon Specialization",
      "types":[
         "Combat"
      ],
      "description":"Choose one type of weapon (including unarmed strike or grapple) for which you possess the Weapon Specialization feat. Your attacks with the chosen weapon are more devastating than normal.",
      "bonus":[
         {
            "benefit":" You gain a +2 bonus on all damage rolls you make using the selected weapon. This bonus to damage stacks with other damage roll bonuses, including any you gain from Weapon Specialization."
         },
         {
            "special":" You can gain Greater Weapon Specialization multiple times. Its effects do not stack. Each time you take the feat, it applies to a new type of weapon."
         }
      ],
      "prerequisites":" Proficiency with selected weapon, Greater Weapon Focus with selected weapon, Weapon Focus with selected weapon, Weapon Specialization with selected weapon, 12th-level fighter."
   },
   {
      "name":"Heighten Spell",
      "types":[
         "Metamagic"
      ],
      "description":"You can cast spells as if they were a higher level.",
      "bonus":[
         {
            "benefit":" A heightened spell has a higher spell level than normal (up to a maximum of 9th level). Unlike other metamagic feats, Heighten Spell actually increases the effective level of the spell that it modifies. All effects dependent on spell level (such as saving throw DCs and ability to penetrate a lesser globe of invulnerability) are calculated according to the heightened level. The heightened spell is as difficult to prepare and cast as a spell of its effective level."
         }
      ]
   },
   {
      "name":"Improved Bull Rush",
      "types":[
         "Combat"
      ],
      "description":"You are skilled at pushing your foes around.",
      "bonus":[
         {
            "prerequisite":" Str 13, Power Attack, base attack bonus +1."
         },
         {
            "benefit":" You do not provoke an attack of opportunity when performing a bull rush combat maneuver. In addition, you receive a +2 bonus on checks made to bull rush a foe. You also receive a +2 bonus to your Combat Maneuver Defense whenever an opponent tries to bull rush you."
         },
         {
            "normal":" You provoke an attack of opportunity when performing a bull rush combat maneuver."
         }
      ]
   },
   {
      "name":"Improved Channel",
      "types":[

      ],
      "description":"Your channeled energy is harder to resist.",
      "bonus":[
         {
            "prerequisite":" Channel energy class feature."
         },
         {
            "benefit":" Add 2 to the DC of saving throws made to resist the effects of your channel energy ability."
         }
      ]
   },
   {
      "name":"Improved Counterspell",
      "types":[

      ],
      "description":"You are skilled at countering the spells of others using similar spells.",
      "bonus":[
         {
            "benefit":" When counterspelling, you may use a spell of the same school that is one or more spell levels higher than the target spell."
         },
         {
            "normal":" Without this feat, you may counter a spell only with the same spell or with a spell specifically designated as countering the target spell."
         }
      ]
   },
   {
      "name":"Improved Critical",
      "types":[
         "Combat"
      ],
      "description":"Attacks made with your chosen weapon are quite deadly.",
      "bonus":[
         {
            "prerequisite":" Proficient with weapon, base attack bonus +8."
         },
         {
            "benefit":" When using the weapon you selected, your threat range is doubled."
         },
         {
            "special":" You can gain Improved Critical multiple times. The effects do not stack. Each time you take the feat, it applies to a new type of weapon."
         },
         {
            "text":"this effect doesn't stack with any other effect that expands the threat range of a weapon."
         }
      ]
   },
   {
      "name":"Improved Disarm",
      "types":[
         "Combat"
      ],
      "description":"You are skilled at knocking weapons from a foe's grasp.",
      "bonus":[
         {
            "prerequisite":" Int 13, Combat Expertise."
         },
         {
            "benefit":" You do not provoke an attack of opportunity when performing a disarm combat maneuver. In addition, you receive a +2 bonus on checks made to disarm a foe. You also receive a +2 bonus to your Combat Maneuver Defense whenever an opponent tries to disarm you."
         },
         {
            "normal":" You provoke an attack of opportunity when performing a disarm combat maneuver."
         }
      ]
   },
   {
      "name":"Improved Familiar",
      "types":[

      ],
      "description":"This feat allows you to acquire a powerful familiar, but only when you could normally acquire a new familiar.",
      "bonus":[
         {
            "benefit":" When choosing a familiar, the creatures listed below are also available to you. You may choose a familiar with an alignment up to one step away on each alignment axis (lawful through chaotic, good through evil)."
         },
         {
            "text":"familiaralignmentarcane spellcaster level\ncelestial hawk1neutral good3rd\ndire ratneutral3rd\nfiendish viper2neutral evil3rd\nelemental, small (any type)neutral5th\nstirgeneutral5th\nhomunculus3any7th\nimplawful evil7th\nmephit (any type)neutral7th\npseudodragonneutral good7th\nquasitchaotic evil7th\n1 or other celestial animal from the standard familiar list.\n2 or other fiendish animal from the standard familiar list.\n3 the master must first create the homunculus."
         },
         {
            "improved familiars otherwise use the rules for regular familiars, with two exceptions":" if the creature's type is something other than animal, its type does not change; and improved familiars do not gain the ability to speak with other creatures of their kind (although many of them already have the ability to communicate)."
         }
      ],
      "prerequisites":" Ability to acquire a new familiar, compatible alignment, sufficiently high level (see below)."
   },
   {
      "name":"Improved Feint",
      "types":[
         "Combat"
      ],
      "description":"You are skilled at fooling your opponents in combat.",
      "bonus":[
         {
            "benefit":" You can make a Bluff check to feint in combat as a move action."
         },
         {
            "normal":" Feinting in combat is a standard action."
         }
      ],
      "prerequisites":" Int 13, Combat Expertise."
   },
   {
      "name":"Improved Grapple",
      "types":[
         "Combat"
      ],
      "description":"You are skilled at grappling opponents.",
      "bonus":[
         {
            "prerequisite":" Dex 13, Improved Unarmed Strike."
         },
         {
            "benefit":" You do not provoke an attack of opportunity when performing a grapple combat maneuver. In addition, you receive a +2 bonus on checks made to grapple a foe. You also receive a +2 bonus to your Combat Maneuver Defense whenever an opponent tries to grapple you."
         },
         {
            "normal":" You provoke an attack of opportunity when performing a grapple combat maneuver."
         }
      ]
   },
   {
      "name":"Improved Great Fortitude",
      "types":[

      ],
      "description":"You can draw upon an inner reserve to resist diseases, poisons, and other grievous harm.",
      "bonus":[
         {
            "benefit":" Once per day, you may reroll a Fortitude save. You must decide to use this ability before the results are revealed. You must take the second roll, even if it is worse."
         }
      ],
      "prerequisites":" Great Fortitude."
   },
   {
      "name":"Improved Initiative",
      "types":[
         "Combat"
      ],
      "description":"Your quick reflexes allow you to react rapidly to danger.",
      "bonus":[
         {
            "benefit":" You get a +4 bonus on initiative checks."
         }
      ]
   },
   {
      "name":"Improved Iron Will",
      "types":[

      ],
      "description":"Your clarity of thought allows you to resist mental attacks.",
      "bonus":[
         {
            "benefit":" Once per day, you may reroll a Will save. You must decide to use this ability before the results are revealed. You must take the second roll, even if it is worse."
         }
      ],
      "prerequisites":" Iron Will."
   },
   {
      "name":"Improved Lightning Reflexes",
      "types":[

      ],
      "description":"You have a knack for avoiding danger all around you.",
      "bonus":[
         {
            "benefit":" Once per day, you may reroll a Reflex save. You must decide to use this ability before the results are revealed. You must take the second roll, even if it is worse."
         }
      ],
      "prerequisites":" Lightning Reflexes."
   },
   {
      "name":"Improved Overrun",
      "types":[
         "Combat"
      ],
      "description":"You are skilled at running down your foes.",
      "bonus":[
         {
            "prerequisite":" Str 13, Power Attack, base attack bonus +1."
         },
         {
            "benefit":" You do not provoke an attack of opportunity when performing an overrun combat maneuver. In addition, you receive a +2 bonus on checks made to overrun a foe. You also receive a +2 bonus to your Combat Maneuver Defense whenever an opponent tries to overrun you. Targets of your overrun attempt may not chose to avoid you."
         },
         {
            "normal":" You provoke an attack of opportunity when performing an overrun combat maneuver."
         }
      ]
   },
   {
      "name":"Improved Precise Shot",
      "types":[
         "Combat"
      ],
      "description":"Your ranged attacks ignore anything but total concealment and cover.",
      "bonus":[
         {
            "benefit":" Your ranged attacks ignore the AC bonus granted to targets by anything less than total cover, and the miss chance granted to targets by anything less than total concealment. Total cover and total concealment provide their normal benefits against your ranged attacks."
         },
         {
            "normal":" See the normal rules on the effects of cover and concealment in Combat."
         }
      ],
      "prerequisites":" Dex 19, Point-Blank Shot, Precise Shot, base attack bonus +11."
   },
   {
      "name":"Improved Shield Bash",
      "types":[
         "Combat"
      ],
      "description":"You can protect yourself with your shield, even if you use it to attack.",
      "bonus":[
         {
            "prerequisite":" Shield Proficiency."
         },
         {
            "benefit":" When you perform a shield bash, you may still apply the shield's shield bonus to your AC."
         },
         {
            "normal":" Without this feat, a character that performs a shield bash loses the shield's shield bonus to AC until his next turn (see Equipment)."
         }
      ]
   },
   {
      "name":"Improved Sunder",
      "types":[
         "Combat"
      ],
      "description":"You are skilled at damaging your foes' weapons and armor.",
      "bonus":[
         {
            "prerequisite":" Str 13, Power Attack, base attack bonus +1."
         },
         {
            "benefit":" You do not provoke an attack of opportunity when performing a sunder combat maneuver. In addition, you receive a +2 bonus on checks made to sunder an item. You also receive a +2 bonus to your Combat Maneuver Defense whenever an opponent tries to sunder your gear."
         },
         {
            "normal":" You provoke an attack of opportunity when performing a sunder combat maneuver."
         }
      ]
   },
   {
      "name":"Improved Trip",
      "types":[
         "Combat"
      ],
      "description":"You are skilled at sending your opponents to the ground.",
      "bonus":[
         {
            "prerequisite":" Int 13, Combat Expertise."
         },
         {
            "benefit":" You do not provoke an attack of opportunity when performing a trip combat maneuver. In addition, you receive a +2 bonus on checks made to trip a foe. You also receive a +2 bonus to your Combat Maneuver Defense whenever an opponent tries to trip you."
         },
         {
            "normal":" You provoke an attack of opportunity when performing a trip combat maneuver."
         }
      ]
   },
   {
      "name":"Improved Two-Weapon Fighting",
      "types":[
         "Combat"
      ],
      "description":"You are skilled at fighting with two weapons.",
      "bonus":[
         {
            "benefit":" In addition to the standard single extra attack you get with an off-hand weapon, you get a second attack with it, albeit at a –5 penalty."
         },
         {
            "normal":" Without this feat, you can only get a single extra attack with an off-hand weapon."
         }
      ],
      "prerequisites":" Dex 17, Two-Weapon Fighting, base attack bonus +6."
   },
   {
      "name":"Improved Unarmed Strike",
      "types":[
         "Combat"
      ],
      "description":"You are skilled at fighting while unarmed.",
      "bonus":[
         {
            "benefit":" You are considered to be armed even when unarmed—you do not provoke attacks of opportunity when you attack foes while unarmed. Your unarmed strikes can deal lethal or nonlethal damage, at your choice."
         },
         {
            "normal":" Without this feat, you are considered unarmed when attacking with an unarmed strike, and you can deal only nonlethal damage with such an attack."
         }
      ]
   },
   {
      "name":"Improved Vital Strike",
      "types":[
         "Combat"
      ],
      "description":"You can make a single attack that deals a large amount of damage.",
      "bonus":[
         {
            "benefit":" When you use the attack action, you can make one attack at your highest base attack bonus that deals additional damage. Roll the weapon's damage dice for the attack three times and add the results together before adding bonuses from Strength, weapon special abilities (such as flaming), precision based damage, and other damage bonuses. These extra weapon damage dice are not multiplied on a critical hit, but are added to the total."
         }
      ],
      "prerequisites":" Vital Strike, base attack bonus +11."
   },
   {
      "name":"Improvised Weapon Mastery",
      "types":[
         "Combat"
      ],
      "description":"You can turn nearly any object into a deadly weapon, from a razor-sharp chair leg to a sack of flour.",
      "bonus":[
         {
            "benefit":" You do not suffer any penalties for using an improvised weapon. Increase the amount of damage dealt by the improvised weapon by one step (for example, 1d4 becomes 1d6) to a maximum of 1d8 (2d6 if the improvised weapon is two-handed). The improvised weapon has a critical threat range of 19–20, with a critical multiplier of ×2."
         }
      ],
      "prerequisites":" Catch Off-Guard or Throw Anything, base attack bonus +8."
   },
   {
      "name":"Intimidating Prowess",
      "types":[
         "Combat"
      ],
      "description":"Your physical might is intimidating to others.",
      "bonus":[
         {
            "benefit":" Add your Strength modifier to Intimidate skill checks in addition to your Charisma modifier."
         }
      ]
   }
]
